[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:64:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <Nav.Link as={Link} to="/requesttypes/all">
-                    Request Types
-                  </Nav.Link>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <>
+                  <Nav.Link as={Link} to="/requesttypes/all">
+                    Request Types
+                  </Nav.Link>
+                </>}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests request types renders correctly for admin user
statusReason: Unable to find an element with the text: Request Types. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:64:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <Nav.Link as={Link} to="/requesttypes/all">
-                    Request Types
-                  </Nav.Link>
-                </>
-              )}
+              {true}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests request types renders correctly for admin user
statusReason: Unable to find an element with the text: Request Types. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
